## Pandas 取数

In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "name":['小明','小王','张菲','关宇','孙小小','王建国','刘蓓'],
    "sex":['男','女','女','男','女','男','女'],
    "age":[20,23,18,21,25,21,24],
    "math":[120,130,118,120,102,140,134],
    "chinese":[100,130,140,120,149,111,118],
    "score":[590,600,550,620,610,580,634], 
    "address":["广东省深圳市南山区",
               "北京市海淀区",
               "湖南省长沙市雨花区",
               "北京市东城区",
               "广东省广州市白云区",
               "湖北省武汉市江夏区",
               "广东省深圳市龙华区"
              ]
})

df

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
1   小王   女   23   130      130    600     北京市海淀区
2   张菲   女   18   118      140    550  湖南省长沙市雨花区
3   关宇   男   21   120      120    620     北京市东城区
4  孙小小   女   25   102      149    610  广东省广州市白云区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

1. 表达式取数

In [2]:
# 1、数学表达式
df[df['math'] > 125]

  name sex  age  math  chinese  score    address
1   小王   女   23   130      130    600     北京市海淀区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [3]:
# 2、取反操作
df[~(df['sex'] == '男')]  # 取出不是男生的数据

  name sex  age  math  chinese  score    address
1   小王   女   23   130      130    600     北京市海淀区
2   张菲   女   18   118      140    550  湖南省长沙市雨花区
4  孙小小   女   25   102      149    610  广东省广州市白云区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [4]:
# 3、指定具体数据
df[df.sex == '男']  # 等同于 df[df['sex'] == '男']

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
3   关宇   男   21   120      120    620     北京市东城区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区

In [5]:
# 4、比较表达式
df[df['math'] > df['chinese']]

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [6]:
# 5、逻辑运算符
df[(df['math'] > 120) & (df['chinese'] < 140)]

  name sex  age  math  chinese  score    address
1   小王   女   23   130      130    600     北京市海淀区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [7]:
# 1、使用数值型表达式
df.query('math > chinese > 110')

  name sex  age  math  chinese  score    address
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [8]:
df.query('math + chinese > 255')

  name sex  age  math  chinese  score    address
1   小王   女   23   130      130    600     北京市海淀区
2   张菲   女   18   118      140    550  湖南省长沙市雨花区

In [9]:
df.query('math == chinese')

  name sex  age  math  chinese  score address
1   小王   女   23   130      130    600  北京市海淀区
3   关宇   男   21   120      120    620  北京市东城区

In [10]:
df.query('math == chinese > 120')

  name sex  age  math  chinese  score address
1   小王   女   23   130      130    600  北京市海淀区

In [11]:
df.query('(math > 110) and (chinese < 135)')  # 两个不等式

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
1   小王   女   23   130      130    600     北京市海淀区
3   关宇   男   21   120      120    620     北京市东城区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [12]:
# 2、使用字符型表达式
df.query('sex != "女"')  # 不等于女，就是全部男

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
3   关宇   男   21   120      120    620     北京市东城区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区

In [13]:
df.query('sex not in ("女")')  # 不在女中就是男

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
3   关宇   男   21   120      120    620     北京市东城区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区

In [14]:
df.query('sex in ("男","女")')   # 性别在男女中就是全部人

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
1   小王   女   23   130      130    600     北京市海淀区
2   张菲   女   18   118      140    550  湖南省长沙市雨花区
3   关宇   男   21   120      120    620     北京市东城区
4  孙小小   女   25   102      149    610  广东省广州市白云区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [15]:
# 3、传入变量；变量在使用的时候需要在前面加上@
a = df.math.mean()
df.query('math > @a + 10')

  name sex  age  math  chinese  score    address
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [16]:
df.query('math < (`chinese` + @a) / 2')

  name sex  age  math  chinese  score    address
2   张菲   女   18   118      140    550  湖南省长沙市雨花区
3   关宇   男   21   120      120    620     北京市东城区
4  孙小小   女   25   102      149    610  广东省广州市白云区

In [17]:
# 1、数值型表达式
df.eval('math > 125')   # 得到的是bool表达式

0    False
1     True
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [18]:
df[df.eval('math > 125')]

  name sex  age  math  chinese  score    address
1   小王   女   23   130      130    600     北京市海淀区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [19]:
df[df.eval('math > 125 and chinese < 130')]

  name sex  age  math  chinese  score    address
5  王建国   男   21   140      111    580  湖北省武汉市江夏区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

In [20]:
# 2、字符型表达式
df[df.eval('sex in ("男")')]

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
3   关宇   男   21   120      120    620     北京市东城区
5  王建国   男   21   140      111    580  湖北省武汉市江夏区

In [21]:
# 3、使用变量
b = df.chinese.mean()  # 求均值
df[df.eval('math < @b+5')]

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
2   张菲   女   18   118      140    550  湖南省长沙市雨花区
3   关宇   男   21   120      120    620     北京市东城区
4  孙小小   女   25   102      149    610  广东省广州市白云区

filter函数
我们使用filter可以对列名或者行名进行筛选，使用方法：

直接指定
正则指定
模糊指定
其中axis=1指定列名；axis=0指定索引

In [22]:
# 1、直接指定属性名
df.filter(items=["chinese","score"])   # 列名操作

   chinese  score
0      100    590
1      130    600
2      140    550
3      120    620
4      149    610
5      111    580
6      118    634

In [23]:
# 2、直接指定行索引
df.filter(items=[2,4],axis=0)   # 行筛选

  name sex  age  math  chinese  score    address
2   张菲   女   18   118      140    550  湖南省长沙市雨花区
4  孙小小   女   25   102      149    610  广东省广州市白云区

In [24]:
# 3、通过正则指定
df.filter(regex='a',axis=1)  # 列名中包含

  name  age  math    address
0   小明   20   120  广东省深圳市南山区
1   小王   23   130     北京市海淀区
2   张菲   18   118  湖南省长沙市雨花区
3   关宇   21   120     北京市东城区
4  孙小小   25   102  广东省广州市白云区
5  王建国   21   140  湖北省武汉市江夏区
6   刘蓓   24   134  广东省深圳市龙华区

In [25]:
df.filter(regex='^s',axis=1)  # 列名以s开始

  sex  score
0   男    590
1   女    600
2   女    550
3   男    620
4   女    610
5   男    580
6   女    634

In [26]:
df.filter(regex='e$',axis=1)  # 列名以e结束

  name  age  chinese  score
0   小明   20      100    590
1   小王   23      130    600
2   张菲   18      140    550
3   关宇   21      120    620
4  孙小小   25      149    610
5  王建国   21      111    580
6   刘蓓   24      118    634

In [27]:
df.filter(regex='3$',axis=0)  # 行索引包含3

  name sex  age  math  chinese  score address
3   关宇   男   21   120      120    620  北京市东城区

In [28]:
# 3、模糊指定
df.filter(like='s',axis=1)   # 列名中包含s

  sex  chinese  score    address
0   男      100    590  广东省深圳市南山区
1   女      130    600     北京市海淀区
2   女      140    550  湖南省长沙市雨花区
3   男      120    620     北京市东城区
4   女      149    610  广东省广州市白云区
5   男      111    580  湖北省武汉市江夏区
6   女      118    634  广东省深圳市龙华区

In [29]:
df.filter(like='2',axis=0)   # 行索引包含2

  name sex  age  math  chinese  score    address
2   张菲   女   18   118      140    550  湖南省长沙市雨花区

In [30]:
# 同时指定列名和索引
df.filter(regex='^a',axis=1).filter(like='2',axis=0)

   age    address
2   18  湖南省长沙市雨花区

### where和mask函数
where和mask函数是一对相反的函数，取出来的结果刚好是相反的：

- where：取出满足要求的数据，不满足的显示为NaN
- mask：取出不满足要求的数据，满足的显示为NaN
两种方法都可以将将NaN值设置我们指定的数据

In [32]:
# where使用
s = df["score"]
s

0    590
1    600
2    550
3    620
4    610
5    580
6    634
Name: score, dtype: int64

In [33]:
# where：满足条件的直接显示，不满足的显示为NaN
s.where(s>=600)

0      NaN
1    600.0
2      NaN
3    620.0
4    610.0
5      NaN
6    634.0
Name: score, dtype: float64

In [34]:
# 我们可以给不满足的进行赋值
s.where(s>=610,600)  # 不满足条件的赋值为600

0    600
1    600
2    600
3    620
4    610
5    600
6    634
Name: score, dtype: int64

In [35]:
# where函数还可以指定多个条件：
# 符合条件的返回True，不符合的返回False
df.where((df.sex=='男') & (df.math > 125))

  name  sex   age   math  chinese  score    address
0  NaN  NaN   NaN    NaN      NaN    NaN        NaN
1  NaN  NaN   NaN    NaN      NaN    NaN        NaN
2  NaN  NaN   NaN    NaN      NaN    NaN        NaN
3  NaN  NaN   NaN    NaN      NaN    NaN        NaN
4  NaN  NaN   NaN    NaN      NaN    NaN        NaN
5  王建国    男  21.0  140.0    111.0  580.0  湖北省武汉市江夏区
6  NaN  NaN   NaN    NaN      NaN    NaN        NaN

In [36]:
# 选出我们想要的数据：
df[(df.where((df.sex=='男') & (df.math > 125)) == df).name]
# df[(df.where((df.sex=='男') & (df.math > 125)) == df).sex]  效果相同

  name sex  age  math  chinese  score    address
5  王建国   男   21   140      111    580  湖北省武汉市江夏区

### mask函数
mask函数获取到的结果和where是相反的

In [37]:
s.mask(s>=600)  # 和where相反：返回的都是小于600的数据

0    590.0
1      NaN
2    550.0
3      NaN
4      NaN
5    580.0
6      NaN
Name: score, dtype: float64

In [38]:
s.mask(s>=610, 600)  # 不满足条件的赋值为600

0    590
1    600
2    550
3    600
4    600
5    580
6    600
Name: score, dtype: int64

In [39]:
# mask函数接受多个条件：
# 取值和where相反
df[(df.mask((df.sex=='男') & (df.math > 125)) == df).sex]

  name sex  age  math  chinese  score    address
0   小明   男   20   120      100    590  广东省深圳市南山区
1   小王   女   23   130      130    600     北京市海淀区
2   张菲   女   18   118      140    550  湖南省长沙市雨花区
3   关宇   男   21   120      120    620     北京市东城区
4  孙小小   女   25   102      149    610  广东省广州市白云区
6   刘蓓   女   24   134      118    634  广东省深圳市龙华区

iloc和loc
iloc是通过数值来进行筛选，loc是通过属性或者行索引名来进行筛选

iloc
直接指定数值，取出单行记录

In [41]:
#  第二份模拟数df

df = pd.DataFrame({
    "name":['小明','小王','张菲','关宇','孙小小','王建国','刘蓓'],
    "sex":['男','女','女','男','女','男','女'],
    "age":[20,23,18,21,25,21,24],
    "score":[np.nan,600,550,np.nan,610,580,634],  # 缺失两条数据
    "address":[
        "广东省深圳市南山区",
        np.nan,  # 数据缺失
        "湖南省长沙市雨花区",
        "北京市东城区",
        "广东省广州市白云区",
        "湖北省武汉市江夏区",
        "广东省深圳市龙华区"
        ]
})

df

  name sex  age  score    address
0   小明   男   20    NaN  广东省深圳市南山区
1   小王   女   23  600.0        NaN
2   张菲   女   18  550.0  湖南省长沙市雨花区
3   关宇   男   21    NaN     北京市东城区
4  孙小小   女   25  610.0  广东省广州市白云区
5  王建国   男   21  580.0  湖北省武汉市江夏区
6   刘蓓   女   24  634.0  广东省深圳市龙华区

In [42]:
# 1、使用数值

df1 = df.iloc[1]  # 单个数值取出的行记录
df1

name          小王
sex            女
age           23
score      600.0
address      NaN
Name: 1, dtype: object

In [43]:
df1 = df.iloc[1,:]  # :冒号表示全部
df1

name          小王
sex            女
age           23
score      600.0
address      NaN
Name: 1, dtype: object

In [44]:
df1 = df.iloc[:3]  # 取出前3行记录
df1

  name sex  age  score    address
0   小明   男   20    NaN  广东省深圳市南山区
1   小王   女   23  600.0        NaN
2   张菲   女   18  550.0  湖南省长沙市雨花区

In [45]:
df2 = df.iloc[[1,2,4]]  # 取出多行记录
df2

  name sex  age  score    address
1   小王   女   23  600.0        NaN
2   张菲   女   18  550.0  湖南省长沙市雨花区
4  孙小小   女   25  610.0  广东省广州市白云区

In [46]:
# 2、取出行记录的部分列属性

df3 = df.iloc[2,0:2]
df3

name    张菲
sex      女
Name: 2, dtype: object

In [47]:
# 列方向上使用切片，步长为2

df4 = df.iloc[2,0:5:2]  
df4

name              张菲
age               18
address    湖南省长沙市雨花区
Name: 2, dtype: object

In [48]:
# 行索引为2，列索引号为1 和 3

df5 = df.iloc[2,[1,3]]  
df5

sex          女
score    550.0
Name: 2, dtype: object

In [49]:
# 3、取出具体的值

df6 = df.iloc[2,4]
df6

'湖南省长沙市雨花区'

In [50]:
# 4、行和列方向同时使用切片

df7 = df.iloc[0:4,0:6:2]
df7

  name  age    address
0   小明   20  广东省深圳市南山区
1   小王   23        NaN
2   张菲   18  湖南省长沙市雨花区
3   关宇   21     北京市东城区

！！！一个非常有用的方法：np.r_，帮助我们取出非连续的列属性

In [51]:
# 5、取出不连续的行列数据，使用np.r_

df8 = df.iloc[:, np.r_[0,2:4]]
df8

  name  age  score
0   小明   20    NaN
1   小王   23  600.0
2   张菲   18  550.0
3   关宇   21    NaN
4  孙小小   25  610.0
5  王建国   21  580.0
6   刘蓓   24  634.0

In [52]:
df9 = df.iloc[np.r_[0,2:4],:]
df9

  name sex  age  score    address
0   小明   男   20    NaN  广东省深圳市南山区
2   张菲   女   18  550.0  湖南省长沙市雨花区
3   关宇   男   21    NaN     北京市东城区

loc
使用的行索引名或者列属性直接来取数

In [53]:
# 1、取出单个列

df10 = df.loc[:,"name"]  
df10

0     小明
1     小王
2     张菲
3     关宇
4    孙小小
5    王建国
6     刘蓓
Name: name, dtype: object

In [54]:
# 2、取数多个列

df11 = df.loc[:,["name","age"]]  
df11

  name  age
0   小明   20
1   小王   23
2   张菲   18
3   关宇   21
4  孙小小   25
5  王建国   21
6   刘蓓   24

In [55]:
#  3、使用数值，取出第一行，索引为0

df12 = df.loc[0]
df12

name              小明
sex                男
age               20
score            NaN
address    广东省深圳市南山区
Name: 0, dtype: object

In [56]:
# 使用冒号:，表示全部列，效果同上

df14 = df.loc[[0,1,3],:]  
df14

  name sex  age  score    address
0   小明   男   20    NaN  广东省深圳市南山区
1   小王   女   23  600.0        NaN
3   关宇   男   21    NaN     北京市东城区

In [57]:
# 5、取出部分行和部分列

df15 = df.loc[[0,1,3],["name","sex","score"]]
df15

  name sex  score
0   小明   男    NaN
1   小王   女  600.0
3   关宇   男    NaN

In [58]:
# 6、!!!使用索引切片：同时包含起止位置

df16 = df.loc[0:3]
df16

  name sex  age  score    address
0   小明   男   20    NaN  广东省深圳市南山区
1   小王   女   23  600.0        NaN
2   张菲   女   18  550.0  湖南省长沙市雨花区
3   关宇   男   21    NaN     北京市东城区

In [59]:
df.loc[:]  # 表示所有数据

  name sex  age  score    address
0   小明   男   20    NaN  广东省深圳市南山区
1   小王   女   23  600.0        NaN
2   张菲   女   18  550.0  湖南省长沙市雨花区
3   关宇   男   21    NaN     北京市东城区
4  孙小小   女   25  610.0  广东省广州市白云区
5  王建国   男   21  580.0  湖北省武汉市江夏区
6   刘蓓   女   24  634.0  广东省深圳市龙华区

In [60]:
# 7、列筛选的时候，必须有行元素

# 所有行的name和score两列
df17 = df.loc[:,["name","score"]]
df17

  name  score
0   小明    NaN
1   小王  600.0
2   张菲  550.0
3   关宇    NaN
4  孙小小  610.0
5  王建国  580.0
6   刘蓓  634.0

In [61]:
# 所有行的age及后面全部列

df18 = df.loc[:,"age":]
df18

   age  score    address
0   20    NaN  广东省深圳市南山区
1   23  600.0        NaN
2   18  550.0  湖南省长沙市雨花区
3   21    NaN     北京市东城区
4   25  610.0  广东省广州市白云区
5   21  580.0  湖北省武汉市江夏区
6   24  634.0  广东省深圳市龙华区

In [62]:
# 8、部分行，age及其后面的全部列

# 谨记：包含起止位置，这是和python切片不同的地方

df19 = df.loc[1:3,"age":]
df19

   age  score    address
1   23  600.0        NaN
2   18  550.0  湖南省长沙市雨花区
3   21    NaN     北京市东城区

In [68]:
# 第一份模拟数据df0

df0 = pd.DataFrame(
    [[101, 102, 140], [114, 95, 67], [87, 128, 117]],
    index=['语文', '数学', '英语'],
    columns=['小明', '小红',"小孙"])

df0

     小明   小红   小孙
语文  101  102  140
数学  114   95   67
英语   87  128  117

In [69]:
# 9、针对非数值型行索引的取数

df20 = df0.loc["语文"]
df20

小明    101
小红    102
小孙    140
Name: 语文, dtype: int64

In [70]:
# 10、注意两个方括号取出的是DataFrame数据，单个括号是Series型数据

df0.loc[["语文"]]

     小明   小红   小孙
语文  101  102  140

In [71]:
df0.loc[["语文","英语"]]

     小明   小红   小孙
语文  101  102  140
英语   87  128  117

In [72]:
# 11、取出部分行和列数据

df21 = df0.loc[["语文","英语"],"小明"]  
df21

语文    101
英语     87
Name: 小明, dtype: int64

In [73]:
# 12、直接使用行索引名来取数

df0.loc[["语文","英语"]]

     小明   小红   小孙
语文  101  102  140
英语   87  128  117

# # 两者对比

In [74]:
df.loc[[1,2]]

  name sex  age  score    address
1   小王   女   23  600.0        NaN
2   张菲   女   18  550.0  湖南省长沙市雨花区

In [75]:
df.iloc[[1,2]]

  name sex  age  score    address
1   小王   女   23  600.0        NaN
2   张菲   女   18  550.0  湖南省长沙市雨花区

In [76]:
# 指定我们需要的列属性名

df.loc[[1,2],["name","score"]]

  name  score
1   小王  600.0
2   张菲  550.0

In [77]:
# 取出第1和2行，0和3列

df.iloc[[1,2],np.r_[0,3]]

  name  score
1   小王  600.0
2   张菲  550.0

at和iat
at
at函数类似于loc，但是at函数取出的仅仅是一个值

In [78]:
df22 = df.at[4,"sex"]
df22

'女'

In [79]:
df.at[2,"name"]

'张菲'

In [80]:
# 同时指定索引和列名

df23 = df0.at['语文','小孙']
df23

140

In [81]:
# at、loc连用

df.loc[1].at['age']

23

In [82]:
# 列名为name的第4个元素
df.name.at[4]

'孙小小'

iat
和iloc一样，仅仅支持对数字索引操作

In [83]:
df24 = df.iat[2,4]
df24

'湖南省长沙市雨花区'

In [84]:
df.loc[2].iat[4]

'湖南省长沙市雨花区'

In [85]:
df.iloc[2].iat[4]

'湖南省长沙市雨花区'

any和all
any：如果至少有一个为True，则为True
all：需要所有结果为True，才会为True
当传入的axis=1，会按照行进行查询；axis=0表示按照列查询

### 在Series数据的比较

In [86]:
# 两个False通过any结果为False

pd.Series([False, False]).any()   # False

False

In [87]:
pd.Series([True, False]).any()  # True

True

In [88]:
pd.Series([True, False]).all()  # False

False

In [89]:
# any：是否跳过空值

pd.Series([np.nan]).any()  # False

False

In [90]:
pd.Series([np.nan]).any(skipna=False)  # True

True

In [91]:
# all：是否跳过空值

pd.Series([np.nan]).all()  # True

True

In [92]:
pd.Series([np.nan]).all(skipna=False)  #True

True

### 在DataFrame的比较

In [93]:
# 1、取出待查询的数据
df0.loc[:,["小明","小红"]]

     小明   小红
语文  101  102
数学  114   95
英语   87  128

In [94]:
# 2、进行比较
df0.loc[:,["小明","小红"]] >= 100

       小明     小红
语文   True   True
数学   True  False
英语  False   True

In [95]:
# 3、使用any函数筛选

df0[(df0.loc[:,["小明","小红"]] >= 100).any(1)]

     小明   小红   小孙
语文  101  102  140
数学  114   95   67
英语   87  128  117

In [96]:
# 4、使用all函数筛选：只有语文满足3个人同时大于100

df0[(df0.loc[:,["小明","小红"]] >= 100).all(1)]

     小明   小红   小孙
语文  101  102  140